# Python for Psychologists - Session 3
## Homework assignment

**Exercise 1**.

Below there is a list with duplicate values. Create a list that contains only the unqiue values, that is, a list without any of the values being duplicated. Do so without simply creating a new list and typing in the numbers manually ;)

In [5]:
duplicate_list = [1,1,4,7,3,5,6,4,4,9,11,0,11]

In [6]:
set_list = set(duplicate_list)

In [7]:
no_duplicates_list = list(set_list)
no_duplicates_list

[0, 1, 3, 4, 5, 6, 7, 9, 11]

**Exercise 2**. 

Try to create a pd.Dataframe using a dictionary and set the index to some random safari visitors

In [1]:
import pandas as pd

In [2]:
s1 = pd.Series([23,45,75,81,45,11], name="otter")

s2 = pd.Series([51,94,12,23,91,10], name="sloth")

s3 = pd.Series([13,56,44,20,51,60], name="monkey")

In [15]:
animals = {"otter" : s1, "sloth" : s2, "monkey":s3}
animals = pd.DataFrame(animals)

animals = animals.set_index([["a","b","c","d","e","f"]])
animals

   otter  sloth  monkey
a     23     51      13
b     45     94      56
c     75     12      44
d     81     23      20
e     45     91      51
f     11     10      60

**Exercise 3.**

Try to select the 5 and 6th row in our dataframe using ```i.loc``` and explicitly state, that you want to select all columns!

In [16]:
animals.iloc[4:6,:]

   otter  sloth  monkey
e     45     91      51
f     11     10      60

**Exercise 4**.

Add a new column "last_name" @ the first position of your dataframe, using a single line of code! 

Use this list for the new column:

In [17]:
last_name = ["Mayer", "Baecker", "Ochsmann", "Friedrich", "Stark", "Kraemer"]

In [18]:
animals.insert(0, "last_name", last_name, True)

In [19]:
animals # check your new dataframe

   last_name  otter  sloth  monkey
a      Mayer     23     51      13
b    Baecker     45     94      56
c   Ochsmann     75     12      44
d  Friedrich     81     23      20
e      Stark     45     91      51
f    Kraemer     11     10      60

## Optional exercises

**Exercise 5**.

Use ```dataframe.loc```to select all visitors based on the two conditional statements listed below and save it to a new dataframe and check whether it worked correctly:
- last name ends with "er"
- has seen at least 23 otters

You might need to google for the first bullet point :)

In [28]:
selection = animals.loc[animals["last_name"].str.endswith("er") & (animals["otter"] >= 23)]

In [29]:
selection

  last_name  otter  sloth  monkey
a     Mayer     23     51      13
b   Baecker     45     94      56